# Дана строка и нужно найти ее первое слово.

str_ = input("Enter sentence: ")

str_split = str_.split()
print(str_split[0])
