# Создайте список ['a', 'b', 'c'] и сделайте из него кортеж.
# Создайте кортеж ('a', 'b', 'c'), И сделайте из него список
# Сделайте следующие присвоения одной строкой a = 'a', b=2, c=’python’.
# Создайте кортеж из одного элемента, чтобы при итерировании по этому
# элементы последовательно выводились значения 1, 2, 3.
# Убедитесь что len() исходного кортежа возвращает 1.

list_ = ['a', 'b', 'c']
tuple_ = tuple(list_)
list_two = list(tuple_)
a, b, c = 'a', 2, 'python'
tuple_two = [1, 2, 3],
print(len(tuple_two))
